'''
==============================mac==============================


1，代码上下移动        command+shift+方向

2，按⌃⌥R可在不使用鼠标的情况下访问主工具栏上的运行/调试配置列表。         control+option+r

3，您可以使用F1（查看快速文档）、⌘P（查看参数信息）、⌘B（导航|声明），
在使用代码完成时，类似的快捷方式不仅在编辑器中，而且在建议列表中。

4，要关闭所有编辑器选项卡，请右键单击某个选项卡并选择“全部关闭”。
要关闭除活动选项卡以外的所有选项卡，请按并单击活动选项卡上的“关闭”按钮。

5，To select several words, press and hold , and double-click each word you want to select.



==============================window==============================
1，如果不记得如何调用操作，请按Ctrl+Shift+A并开始键入操作名称

2，如果在调试期间加载变量需要很长时间，您可能会看到加载超时警告消息。
单击“变量”窗口中的“切换到按需加载”链接，在用户请求加载变量时切换到模式。

3，PyCharm社区使在CSS文件中指定颜色变得容易。颜色属性在编辑器边沟中具有相应颜色的图标。
单击图标以使用颜色选择器选择所需的颜色。

4，要在搜索类、文件或符号（双精度）时使用文本模式，请使用*和空格：
*表示任意数量的字符。
空格表示图案的结尾。前面的字符串不只是一个前缀，而是一个完整的模式。建议的名字相应地缩小了范围。

5，PyCharm社区允许您通过上下文菜单命令比较以下内容：
目录
有另一个类或类成员的类或类成员
本地文件及其在本地历史中的版本
版本控制存储库中包含当前版本的本地文件
同一文件的任意两个修订
任何当前在编辑器中打开的本地文件
任意两个本地文件：文本或二进制
带剪贴板内容的活动编辑器
粘贴到空白差异窗口中的任何文本源
您可以在“设置/首选项”对话框的“工具|差异和合并”下，按Ctrl+Alt+S组合键来配置差异工具。

6，按Ctrl+Shift+E可获取最近查看或更改的代码片段的列表。












'''



    
    

    
    
    
    
    
    
    
    
    
    
    
    
    
    